# Напишите программу, которая принимает на вход два числа и проверяет, 
# является ли одно число квадратом другого.
    
   # *Примеры:* 
    
  #  - 5, 25 -> да
  #  - 4, 16 -> да
  #  - 25, 5 -> да
  #  - 8,9 -> нет

# a = int(input('Введите первое число: '))
# b = int(input('Введите второе число: '))
# if a ** 2 == b or b ** 2 == a:
#    print('Да')
# else:
#    print('Нет')

# 2. Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.
    
#  Примеры:
    
#    - 1, 4, 8, 7, 5 -> 8
#    - 78, 55, 36, 90, 2 -> 90


# num = [int(i) for i in input().split()]
# max_num = num[0]
# for i in range(len(num)):
#    if num[i] > max_num:
#        max_num = num[i]
#print(num)
#print(max_num)


# Напишите программу, которая будет на вход принимать число N и выводить числа от -N до N
    
  #  *Примеры:* 
    
  # - 5 -> -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5

#n = int(input('Введите число:'))
#for i in range(-n, n + 1):
#    print(i, end = ', ')

# Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.
# *Примеры:*
# - 6,78 -> 7
#   - 5 -> нет
#    - 0,34 -> 3

d = 33
d1 = int((d * 10) % 10)


# Напишите программу, которая принимает на вход число и проверяет, кратно ли оно 5 и 10 или 15, но не 30.

num = int(input('Введите число: '))
if (num % 5 == 0 and num % 10 == 0 or num % 15 == 0) and num % 30 != 0:
    print('Yes')
else:
    print('No')